# Tutoriel d'introduction Ã  pandas

[LIEN DU TUTORIEL](https://pandas.pydata.org/docs/user_guide/10min.html)

In [65]:
import numpy as np
import pandas as pd

# Object creation

In [66]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])  
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [67]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

 Les DataFrames sont des ensembles de series

In [68]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.482749  1.055413 -0.939514  0.472471
2013-01-02 -0.059841 -0.736188 -2.439607  0.325730
2013-01-03 -1.367556  1.219779  0.310320  0.335704
2013-01-04 -1.140908 -1.318942  0.664544  1.149964
2013-01-05 -0.111396  0.146750 -0.135695  1.435682
2013-01-06 -0.936792 -0.702110 -0.815680 -2.797578

In [69]:
df2 = pd.DataFrame(
    {
    "A": 1.0,
    "B": pd.Timestamp("20130102"),
    "C": pd.Series(1, index=list(range(4)), dtype="float32"),
    "D": np.array([3] * 4, dtype="int32"),
    "E": pd.Categorical(["test", "train", "test", "train"]),
    "F": "foo",
    }
    )

df2
# df2.C
# df2["C"]

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [70]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# Viewing data

In [71]:
df.head(2)

                   A         B         C         D
2013-01-01  0.482749  1.055413 -0.939514  0.472471
2013-01-02 -0.059841 -0.736188 -2.439607  0.325730

In [72]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.140908 -1.318942  0.664544  1.149964
2013-01-05 -0.111396  0.146750 -0.135695  1.435682
2013-01-06 -0.936792 -0.702110 -0.815680 -2.797578

In [73]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [75]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [77]:
df.to_numpy()

array([[ 0.48274944,  1.05541301, -0.93951397,  0.4724707 ],
       [-0.05984136, -0.7361882 , -2.43960723,  0.3257296 ],
       [-1.36755551,  1.21977937,  0.31032002,  0.33570444],
       [-1.14090828, -1.31894201,  0.66454363,  1.14996379],
       [-0.11139621,  0.14675031, -0.13569541,  1.43568195],
       [-0.93679246, -0.70211029, -0.81567975, -2.79757761]])

Numpy ne peut avoir qu'un type pour un tableau entier, donc il cast dans un type qui est commun a tout le monde donc quand il y a bcp de type diffÃ©rents dans le mÃªme DataFrame, il cast tout en object.

A noter Ã©galement que lors de l'utilisation de `to_numpy()`, les index et les labels de colonnes ne sont pas inclus dans la sortie.

In [80]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [84]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.522291 -0.055883 -0.559272  0.153662
std    0.729626  1.037217  1.111694  1.517260
min   -1.367556 -1.318942 -2.439607 -2.797578
25%   -1.089879 -0.727669 -0.908555  0.328223
50%   -0.524094 -0.277680 -0.475688  0.404088
75%   -0.072730  0.828247  0.198816  0.980591
max    0.482749  1.219779  0.664544  1.435682

In [86]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.482749   -0.059841   -1.367556   -1.140908   -0.111396   -0.936792
B    1.055413   -0.736188    1.219779   -1.318942    0.146750   -0.702110
C   -0.939514   -2.439607    0.310320    0.664544   -0.135695   -0.815680
D    0.472471    0.325730    0.335704    1.149964    1.435682   -2.797578

In [99]:
df.sort_index(axis=1, ascending=False) # les colonne et lignes sont inversÃ©es dans l'ordre

                   D         C         B         A
2013-01-01  0.472471 -0.939514  1.055413  0.482749
2013-01-02  0.325730 -2.439607 -0.736188 -0.059841
2013-01-03  0.335704  0.310320  1.219779 -1.367556
2013-01-04  1.149964  0.664544 -1.318942 -1.140908
2013-01-05  1.435682 -0.135695  0.146750 -0.111396
2013-01-06 -2.797578 -0.815680 -0.702110 -0.936792

In [101]:
df.sort_values(by="B") # trie en fonction des valeurs de B

                   A         B         C         D
2013-01-04 -1.140908 -1.318942  0.664544  1.149964
2013-01-02 -0.059841 -0.736188 -2.439607  0.325730
2013-01-06 -0.936792 -0.702110 -0.815680 -2.797578
2013-01-05 -0.111396  0.146750 -0.135695  1.435682
2013-01-01  0.482749  1.055413 -0.939514  0.472471
2013-01-03 -1.367556  1.219779  0.310320  0.335704

# Selection
## Getting

In [103]:
df["A"]

2013-01-01    0.482749
2013-01-02   -0.059841
2013-01-03   -1.367556
2013-01-04   -1.140908
2013-01-05   -0.111396
2013-01-06   -0.936792
Freq: D, Name: A, dtype: float64

In [105]:
df[0:3]

                   A         B         C         D
2013-01-01  0.482749  1.055413 -0.939514  0.472471
2013-01-02 -0.059841 -0.736188 -2.439607  0.325730
2013-01-03 -1.367556  1.219779  0.310320  0.335704

In [108]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.059841 -0.736188 -2.439607  0.325730
2013-01-03 -1.367556  1.219779  0.310320  0.335704
2013-01-04 -1.140908 -1.318942  0.664544  1.149964

## Selection by label

In [113]:
df.loc[dates[0]:dates[2]]

                   A         B         C         D
2013-01-01  0.482749  1.055413 -0.939514  0.472471
2013-01-02 -0.059841 -0.736188 -2.439607  0.325730
2013-01-03 -1.367556  1.219779  0.310320  0.335704

In [114]:
df[dates[0]:dates[2]]

                   A         B         C         D
2013-01-01  0.482749  1.055413 -0.939514  0.472471
2013-01-02 -0.059841 -0.736188 -2.439607  0.325730
2013-01-03 -1.367556  1.219779  0.310320  0.335704

In [118]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.482749  1.055413
2013-01-02 -0.059841 -0.736188
2013-01-03 -1.367556  1.219779
2013-01-04 -1.140908 -1.318942
2013-01-05 -0.111396  0.146750
2013-01-06 -0.936792 -0.702110

In [120]:
df.loc[[dates[0], dates[2]], ["A","B"]]

                   A         B
2013-01-01  0.482749  1.055413
2013-01-03 -1.367556  1.219779

In [122]:
df.loc[dates[0], "A"]

0.48274944443195655

In [126]:
df.at[dates[0], "A"] # fait pour accÃ©der une valeur unique, imposible d'atteindre plusieurs valeurs avec cette commande

0.48274944443195655

## Selection by position

In [132]:
df.iloc[3] # affiche la 4Ã¨me ligne

A   -1.140908
B   -1.318942
C    0.664544
D    1.149964
Name: 2013-01-04 00:00:00, dtype: float64

In [133]:
df

                   A         B         C         D
2013-01-01  0.482749  1.055413 -0.939514  0.472471
2013-01-02 -0.059841 -0.736188 -2.439607  0.325730
2013-01-03 -1.367556  1.219779  0.310320  0.335704
2013-01-04 -1.140908 -1.318942  0.664544  1.149964
2013-01-05 -0.111396  0.146750 -0.135695  1.435682
2013-01-06 -0.936792 -0.702110 -0.815680 -2.797578

In [136]:
df.iloc[3:5, 0:2] # 4Ã¨me t 5 Ã¨me avec les 2 premier Ã©lÃ©ments

                   A         B
2013-01-04 -1.140908 -1.318942
2013-01-05 -0.111396  0.146750

In [141]:
df.iloc[1:3, :] # sÃ©lectionne les 2 premiÃ¨res lignes

                   A         B         C         D
2013-01-02 -0.059841 -0.736188 -2.439607  0.325730
2013-01-03 -1.367556  1.219779  0.310320  0.335704

In [143]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02 -0.059841 -2.439607
2013-01-03 -1.367556  0.310320
2013-01-05 -0.111396 -0.135695

In [146]:
df.iloc[:,1:3]

                   B         C
2013-01-01  1.055413 -0.939514
2013-01-02 -0.736188 -2.439607
2013-01-03  1.219779  0.310320
2013-01-04 -1.318942  0.664544
2013-01-05  0.146750 -0.135695
2013-01-06 -0.702110 -0.815680

In [152]:
df.iloc[1,1]

-0.7361881971345572

In [154]:
df.iat[1,1]

-0.7361881971345572

In [158]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.482749  1.055413 -0.939514  0.472471

In [160]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.482749  1.055413       NaN  0.472471
2013-01-02       NaN       NaN       NaN  0.325730
2013-01-03       NaN  1.219779  0.310320  0.335704
2013-01-04       NaN       NaN  0.664544  1.149964
2013-01-05       NaN  0.146750       NaN  1.435682
2013-01-06       NaN       NaN       NaN       NaN

In [165]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]

df2

                   A         B         C         D      E
2013-01-01  0.482749  1.055413 -0.939514  0.472471    one
2013-01-02 -0.059841 -0.736188 -2.439607  0.325730    one
2013-01-03 -1.367556  1.219779  0.310320  0.335704    two
2013-01-04 -1.140908 -1.318942  0.664544  1.149964  three
2013-01-05 -0.111396  0.146750 -0.135695  1.435682   four
2013-01-06 -0.936792 -0.702110 -0.815680 -2.797578  three

In [168]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03 -1.367556  1.219779  0.310320  0.335704   two
2013-01-05 -0.111396  0.146750 -0.135695  1.435682  four

## Setting

In [171]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [173]:
df["F"] =s1

In [175]:
df.at[dates[0], "A"] = 0

In [177]:
df

                   A         B         C         D    F
2013-01-01  0.000000  1.055413 -0.939514  0.472471  NaN
2013-01-02 -0.059841 -0.736188 -2.439607  0.325730  1.0
2013-01-03 -1.367556  1.219779  0.310320  0.335704  2.0
2013-01-04 -1.140908 -1.318942  0.664544  1.149964  3.0
2013-01-05 -0.111396  0.146750 -0.135695  1.435682  4.0
2013-01-06 -0.936792 -0.702110 -0.815680 -2.797578  5.0

In [180]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.939514  0.472471  NaN
2013-01-02 -0.059841 -0.736188 -2.439607  0.325730  1.0
2013-01-03 -1.367556  1.219779  0.310320  0.335704  2.0
2013-01-04 -1.140908 -1.318942  0.664544  1.149964  3.0
2013-01-05 -0.111396  0.146750 -0.135695  1.435682  4.0
2013-01-06 -0.936792 -0.702110 -0.815680 -2.797578  5.0

In [183]:
df.loc[:,"D"] = np.array([5]*len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.939514  5  NaN
2013-01-02 -0.059841 -0.736188 -2.439607  5  1.0
2013-01-03 -1.367556  1.219779  0.310320  5  2.0
2013-01-04 -1.140908 -1.318942  0.664544  5  3.0
2013-01-05 -0.111396  0.146750 -0.135695  5  4.0
2013-01-06 -0.936792 -0.702110 -0.815680  5  5.0

In [185]:
df2 = df.copy()

In [187]:
df2[df2 > 0] = -df2

In [189]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.939514 -5  NaN
2013-01-02 -0.059841 -0.736188 -2.439607 -5 -1.0
2013-01-03 -1.367556 -1.219779 -0.310320 -5 -2.0
2013-01-04 -1.140908 -1.318942 -0.664544 -5 -3.0
2013-01-05 -0.111396 -0.146750 -0.135695 -5 -4.0
2013-01-06 -0.936792 -0.702110 -0.815680 -5 -5.0

## Missing data

In [193]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+["E"])
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000 -0.939514  5  NaN NaN
2013-01-02 -0.059841 -0.736188 -2.439607  5  1.0 NaN
2013-01-03 -1.367556  1.219779  0.310320  5  2.0 NaN
2013-01-04 -1.140908 -1.318942  0.664544  5  3.0 NaN

In [195]:
df1.dropna(how="any")

Empty DataFrame
Columns: [A, B, C, D, F, E]
Index: []